IDENTIFICATION DIVISION.
PROGRAM-ID. NEURAL-NETWORK.
 
ENVIRONMENT DIVISION.
 
DATA DIVISION.
WORKING-STORAGE SECTION.
 
01 INPUT-VECTOR PIC 9(3).
01 HIDDEN-LAYER-VECTOR PIC 9(3).
01 OUTPUT-VECTOR PIC 9(3).
 
01 WEIGHTS-INPUT-HIDDEN PIC 9(3).
01 WEIGHTS-HIDDEN-OUTPUT PIC 9(3).
 
01 INPUT-BIAS PIC 9(3).
01 HIDDEN-BIAS PIC 9(3).
 
01 INPUT-OUTPUT-DIFFERENCE PIC 9(3).
 
01 ACTIVATION-FUNCTION PIC 9(3).
 
01 I PIC 9(3).
01 J PIC 9(3).
 
PROCEDURE DIVISION.
 
START-PROGRAM.
 
PERFORM INITIALIZE-VECTORS.
 
PERFORM CALCULATE-WEIGHTS.
 
PERFORM CALCULATE-ACTIVATION-FUNCTION.
 
PERFORM CALCULATE-OUTPUT.
 
PERFORM CALCULATE-ERROR.
 
PERFORM ADJUST-WEIGHTS.
 
GO TO START-PROGRAM.
 
INITIALIZE-VECTORS.
 
MOVE ZEROES TO INPUT-VECTOR.
MOVE ZEROES TO HIDDEN-LAYER-VECTOR.
MOVE ZEROES TO OUTPUT-VECTOR.
 
CALCULATE-WEIGHTS.
 
PERFORM VARYING I FROM 1 BY 1 UNTIL 3
 
PERFORM VARYING J FROM 1 BY 1 UNTIL 3
 
COMPUTE WEIGHTS-INPUT-HIDDEN(I,J) = INPUT-VECTOR(I) 
									 * HIDDEN-LAYER-VECTOR(J).
COMPUTE WEIGHTS-HIDDEN-OUTPUT(I,J) = HIDDEN-LAYER-VECTOR(I) 
									  * OUTPUT-VECTOR(J).
 
END-PERFORM
END-PERFORM.
 
CALCULATE-ACTIVATION-FUNCTION.
 
PERFORM VARYING I FROM 1 BY 1 UNTIL 3
 
COMPUTE HIDDEN-BIAS(I) = WEIGHTS-INPUT-HIDDEN(I) + INPUT-BIAS(I).
 
COMPUTE ACTIVATION-FUNCTION(I) = 
	(HIDDEN-BIAS(I) * HIDDEN-LAYER-VECTOR(I) + OUTPUT-BIAS(I)).
 
END-PERFORM.
 
CALCULATE-OUTPUT.
 
PERFORM VARYING I FROM 1 BY 1 UNTIL 3
 
COMPUTE OUTPUT-VECTOR(I) = ACTIVATION-FUNCTION(I) 
							* WEIGHTS-HIDDEN-OUTPUT(I).
 
END-PERFORM.
 
CALCULATE-ERROR.
 
PERFORM VARYING I FROM 1 BY 1 UNTIL 3
 
COMPUTE INPUT-OUTPUT-DIFFERENCE(I) = OUTPUT-VECTOR(I) 
									- INPUT-VECTOR(I).
 
END-PERFORM.
 
ADJUST-WEIGHTS.
 
PERFORM VARYING I FROM 1 BY 1 UNTIL 3
 
PERFORM VARYING J FROM 1 BY 1 UNTIL 3
 
COMPUTE WEIGHTS-INPUT-HIDDEN(I,J) = WEIGHTS-INPUT-HIDDEN(I,J) 
									+ INPUT-OUTPUT-DIFFERENCE(I).
COMPUTE WEIGHTS-HIDDEN-OUTPUT(I,J) = WEIGHTS-HIDDEN-OUTPUT(I,J) 
									+ INPUT-OUTPUT-DIFFERENCE(I).
 
END-PERFORM
END-PERFORM.
 
STOP RUN.
